Revit 2027 API
ParameterTypeId.StairsRailingRailStructure Property
 "Rail Structure (Non-Continuous)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingRailStructure { get; }
Public Shared ReadOnly Property StairsRailingRailStructure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingRailStructure {
	ForgeTypeId^ get ();
}
static member StairsRailingRailStructure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace